app/views/ideas/index.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`idea_id` = 18
---
    <% end %>
    いいね件数: <%= t.likes.count %>