app/views/ouchis/index.html.erb

    <div class='text'>
    <% @part_ranks=@all_ranks.select{|idea| idea.ouchi_id == t.id} %>
---
SELECT `ouchis`.* FROM `ouchis`