app/views/user1s/show.html.erb

<h2>投稿アイデア一覧</h2>
<% @user.ideas.each do |t| %>
---
SELECT `ideas`.* FROM `ideas` WHERE `ideas`.`user_id` = 1