app/controllers/ideas_controller.rb

    def new
        @ouchi=Ouchi.find(params[:ouchi_id])
---
SELECT `ouchis`.* FROM `ouchis` WHERE `ouchis`.`id` = 1 LIMIT 1

    def create
        @ouchi=Ouchi.find(params[:ouchi_id])
        @idea=@ouchi.ideas.build(idea_params)
        @idea.user_id=current_user.id
        if @idea.save
---
SELECT `ouchis`.* FROM `ouchis` WHERE `ouchis`.`id` = 1 LIMIT 1
INSERT INTO `ideas` (`ouchi_id`, `created_at`, `updated_at`, `idea`, `user_id`) VALUES (1, '2020-06-12 12:21:55.986843', '2020-06-12 12:21:55.986843', 'netflix partyで友達と鑑賞', 3)

    def index
        @ouchi=Ouchi.find(params[:ouchi_id])
        @all_ranks = Idea.find(Like.group(:idea_id).order('count(idea_id) desc').limit(150).pluck(:idea_id))
        @ouchiid=params[:id]
        @new=@ouchi.category+'の新規投稿画面へ'
        @ouchi=Ouchi.find(params[:ouchi_id])
---
SELECT `ouchis`.* FROM `ouchis` WHERE `ouchis`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `likes` WHERE `likes`.`idea_id` = 18
SELECT `ouchis`.* FROM `ouchis` WHERE `ouchis`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]