app/controllers/likes_controller.rb

INSERT INTO `likes` (`idea_id`, `user_id`, `created_at`, `updated_at`) VALUES (3, 1, '2020-05-30 12:55:47.100764', '2020-05-30 12:55:47.100764')
---
    def create
        @like = current_user.likes.create(idea_id: params[:idea_id])

SELECT `likes`.* FROM `likes` WHERE `likes`.`idea_id` IS NULL AND `likes`.`user_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
      def destroy
        @like = Like.find_by(idea_id: params[:idea_id], user_id: current_user.id)
        @like.destroy