app/controllers/ouchis_controller.rb

    def index
        @ouchi=Ouchi.all
---
SELECT `ouchis`.* FROM `ouchis`

    def show

        @ouchi=Ouchi.find(params[:id])
        @ideas=@ouchi.ideas.all
---
SELECT `ouchis`.* FROM `ouchis` WHERE `ouchis`.`id` = 1 LIMIT 1
SELECT `ideas`.* FROM `ideas` WHERE `ideas`.`id` = 1 LIMIT 1